app/controllers/places_controller.rb

SELECT  "places".* FROM "places"  WHERE "places"."name" = 'Brooklyn Children''s Museum'  ORDER BY "places"."id" ASC LIMIT 1
---
  def show
    @place = Place.where(name: params[:name]).first