app/controllers/stories_controller.rb

SELECT  "stories".* FROM "stories"  WHERE "stories"."id" = 3 LIMIT 1
---
  def show
    @story = Story.find_by(id: params[:id])

SELECT  "stories".* FROM "stories"  WHERE "stories"."id" = 3 LIMIT 1
---
  def edit
    @story = Story.find_by(id: params[:id])

INSERT INTO "stories" ("body", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", ""], ["created_at", "2014-10-30 02:01:54.001940"], ["title", ""], ["updated_at", "2014-10-30 02:01:54.001940"]]
---
  def create
    @story = Story.new(story_params)

    respond_to do |format|
      if @story.save