app/controllers/welcome_controller.rb

  def index
    if session[:user_id]
      user = User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2 LIMIT 1